#  Поработайте с переменными, создайте несколько,
#  выведите на экран, запросите у пользователя несколько чисел и строк
#  и сохраните в переменные, выведите на экран.


x = 5
y = 14
print(x, y)
car_manufacturer = input('Введите производителя автомобиля: ')
car_model = input('Введите модель автомобиля: ')
car_year = int(input('Введите год выпуска автомобиля: '))
car_mileage = int(input('Введите пробег автомобиля: '))
print(f"Производитель: {car_manufacturer} \nМодель: {car_model} \nГод выпуска: {car_year}. \nПробег: {car_mileage} км.")
