# Спортсмен занимается ежедневными пробежками.
# В первый день его результат составил a километров.
# Каждый день спортсмен увеличивал результат на 10 % относительно предыдущего.
# Требуется определить номер дня, на который общий результат спортсмена составит не менее b километров.
# Программа должна принимать значения параметров a и b и выводить одно натуральное число — номер дня.

a = int(input('Введите результат пробежки в первый день, км: '))
b = int(input('Введите желаемый результат, км: '))
i = 1
while a < b:
    a *= 1.1
    i += 1
print(i)  # первый день включён в результат
